#### ❌ Terraform Plan — `prod`

<details>
<summary>Show plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_dynamodb_table.tfm_state_lock will be created
  + resource "aws_dynamodb_table" "tfm_state_lock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "tfm-state-lock"
      + read_capacity    = (known after apply)
      + region           = "us-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Error: failed to get shared config profile, wri-aws-terraform

  with module.infrastructure.provider["registry.terraform.io/hashicorp/aws"],
  on ../../k8s-infrastructure/versions.tf line 1, in provider "aws":
   1: provider "aws" {

::error::Terraform exited with code 1.

```

</details>

*Triggered by @carloshdelreal in #9*